package egret.core
{
	import flash.display.NativeWindow;
	
	/**
	 * IWindow接口用于定义在Desktop应用中的顶级容器组件的API。
	 * @author 雷羽佳 2014.6.17 11:26
	 * 
	 */	
	public interface IWindow
	{
		//--------------------------------------------------------------------------
		//
		//  属性部分
		//
		//--------------------------------------------------------------------------
		
		//----------------------------------
		//  最大化
		//----------------------------------
		
		/**指定是否可以将窗口最大化。*/
		function get maximizable():Boolean;
		
		//----------------------------------
		//  最小化
		//----------------------------------
		
		/**指定是否可以将窗口最小化。*/
		function get minimizable():Boolean;
		
		//----------------------------------
		//  原生窗体
		//----------------------------------
		
		/**在Window组件内部使用的原生窗体*/
		function get nativeWindow():NativeWindow
		
		//----------------------------------
		//  可调节大小
		//----------------------------------
		
		/**指定是否可以调节窗口的大小。 */
		function get resizable():Boolean;
		
		//----------------------------------
		//  状态栏
		//----------------------------------
		
//		/**在状态栏可见的情况下，出现在状态栏中的文字*/
//		function get status():String;
//		function set status(value:String):void;
		
		//----------------------------------
		//  窗口系统镶边
		//----------------------------------
		
		/**指定是否为窗口提供系统镶边。
		 *  @see flash.display.NativeWindowSystemChrome
		 */
		function get systemChrome():String;
		
		//----------------------------------
		//  标题
		//----------------------------------
		
		/** 在窗体的标题栏和任务栏出现的标题文本。*/
		function get title():String;
		function set title(value:String):void;
		
		//----------------------------------
		//  标题图标
		//----------------------------------
		
//		/**这个类（通常是一个图片）用于绘制标题栏图标 */
//		function get titleIcon():Class;
//		function set titleIcon(value:Class):void;
		
		//----------------------------------
		//  透明
		//----------------------------------
		
		/**指定窗体是否是透明窗体 */
		function get transparent():Boolean;
		
		//----------------------------------
		//  类型
		//----------------------------------
		
		/**
		 *  指定要创建的窗口的类型。 用作此属性的有效值的常量在 NativeWindowType 类中定义。
		 *  @see flash.display.NativeWindowType
		 */
		function get type():String;
		
		//----------------------------------
		//  是否可见
		//----------------------------------
		
		/**控制窗体是否可见*/
		function get visible():Boolean;
		
		//--------------------------------------------------------------------------
		//
		//  方法
		//
		//--------------------------------------------------------------------------
		
		/**关闭窗体*/
		function close():void;
		
		/**最大化窗体，如果已经最大化则无效果。 */
		function maximize():void
		
		/**最小化窗体*/
		function minimize():void;
		
		/**重置窗体(从最大化中恢复，或从最小化中恢复)*/
		function restore():void;
	}
	
}
